[
  {
    "id": 1,
    "company": "Cognex Job Description",
    "jobdesc": ["Cognex is the world leader in providing vision systems, sensors and industrial barcode readers utilized in manufacturing automation. Reporting to the Manufacturing Engineering Manager, I am assigned autonomously providing high-quality field service support to the day to day operation of our test equipment.", " ", "1. Perform all the field service work for 89 network-connected and computer controlled electro-mechanical test equipment and 36 label printers deployed at our subcontractor in Batam, Indonesia.", "2. Equipment installation, qualification, maintenance, calibration, software and hardware upgrade and fault-finding and repair.", "3. Provide support via telephone, email, Microsoft Teams chat to an average daily 3 field service request.", "4. Prepare and send prompt technical reports and proposals; record, maintain and share repair history documentation. Ensuring all operations are compliant with Cognex specifications.", "5. Provide training and procedures to Engineers, technicians and operators about equipment operation.", "6. Sourcing, supply, and maintain spare parts.", "7. Provide technical support to NPI run, production and Ireland’s sourcing team to resolve production issues that affects the work order."]
  },

  {
    "id": 2,
    "company": "Pt. Sanmina Job Description",
    "jobdesc": ["Pt. Sanmina is an EMS that manufactures Printed Circuit Board Assembly (PCBA) to Box build products. Reported to Test Engineering Manager, appointed to lead three Engineers and 27 Technicians whose responsibility was the delivery of 24/7 support which includes setup, qualification, preventative maintenance, calibration and troubleshooting and repair of equipment on three floors of test operation.", " ", "1. Ensured efficient equipment management including installation, qualification, preventive maintenance, hardware and software upgrade, calibration, as well as troubleshooting and repair of test equipment.", "2. Product testing, failure analyses, and repair", "3. Prepare and send prompt technical engineering reports and proposals; record, maintain and share repair history documentation. Ensure all operations are compliant with customer’s strict regulatory requirements.", "4. Train employees for the operation and maintenance of test equipment to ensure consistent implementation and to enhance productivity.", "5. Organized and officiated tactical meetings with the subordinates, in addition to liaising with customers and colleagues to address equipment and product-related requirements.", "6. Monitor and improve test and production processes.", "7. Participate in production line design setup, compute machine capacity", "8. Root causing, evaluated and recommend solutions to production line issues. ", "9. Research of new innovative technologies for process improvements"]
  },

  {
    "id": 3,
    "company": "Pt. PCI Job Description",
    "jobdesc": ["PT. PCI is an EMS company that designs and manufactures PCBA to box build solutions for customers from the automotive, industrial weighing scales, household appliances, fitness equipment, and medical products industries. Reported to the Engineering Manager; Supervised Two-Test Engineers and 12 Technicians to support 24/7 production test operation; Managed one Debug Engineer and 15 Technicians who were assigned the responsibility of repairing defective printed circuit boards.", " ", "1. Ensured efficient equipment management including installation, qualification, preventive maintenance, hardware and software upgrade, calibration, as well as troubleshooting and repair of test equipment.", "2. Product testing, failure analyses, and repair", "3. Prepare and send prompt technical engineering reports and proposals; record, maintain and share repair history documentation. Ensure all operations are compliant with customer’s strict regulatory requirements.", "4. Train employees for the operation and maintenance of test equipment to ensure consistent implementation and to enhance productivity.", "5. Organized and officiated tactical meetings with the subordinates, in addition to liaising with customers and colleagues to address equipment and product-related requirements.", "6. Monitor and improve test and production processes.", "7. Participate in production line design setup, compute machine capacity", "8. Root causing, evaluated and recommend solutions to production line issues. ", "9. Research of new innovative technologies for process improvements", "10. Dispatched for product transfer and to resolve equipment and product issues in different customer sites (USA and China) and overseas equipment training (Singapore)."]
  }
]
